const replyText = {

    serchModeOn : '夜夜酱现在已经切换至搜图模式啦(^・ω・^ )',
    serchModeOff : '夜夜酱已经成功退出搜图模式啦(^・ω・^ )',
    serchModeAutoOff : '搜图模式下的夜夜好累T T，防止坏掉已经自动退出啦，下次记得为我手动关闭哦..',
    alreadyInSerchMode : '夜夜酱已经在搜图模式下啦，不要再叫夜夜了',
    notAtSerchMode : '夜夜酱现在并不在搜图模式下哦，需要开启吗？',

    serchLimit : '主人今天使用夜夜酱的次数过多了呢❤，明天再来吧',

    defaultReply : '夜夜酱暂时还不明白主人说什么呢（/TДT)/',

    debugMode : '夜夜酱正在修复自己的身体呢，等修复完成后再来吧❤',

    refuse : '抱歉哦，夜夜酱不能为你服务呢',
    setuLimit : '少年节制啊节制（虽然夜夜酱是很开心啦',
    setuAbnormal : '夜夜酱的色图功能坏掉了啦..',

}


replyText.helptext = '1.@夜夜酱附带图片可以实现全网检索哦。' + 
'也可以加上 \'限定pixiv/danbooru/book/anime\'来限定搜索来源呢，' +
'比如只想搜索p站，那么附带图片后可以写上 \'限定pixiv\'；\n' +
'2.可以@夜夜酱 开启/关闭搜图模式，在搜图模式下，接下来群内所有图片都会被检索，主人可以快速检索多张图片哦。' +
'当然，在此模式下也是可以直接发送pixiv/danbooru/book/anime 来限定搜索来源的，夜夜酱会切换到对应模式哦。' +
'手动未关闭情况下，一段时间后也是会自动关闭搜图模式的，防止打扰到主人们正常聊天；\n' +
'3.可以@夜夜酱 查询番剧销量数据哦，比如\'我要看新番销量\'、\'7月番销量\、\'19年1月番销量\'之类哦； \n' + 
'4.可以@夜夜酱 查询番剧日程哦，比如\'今天有什么番\'、\'明天什么番\'、\'这周日什么番\'、\'20181230什么番\'； \n' + 
'5.夜夜酱是支持私聊的呢。\n' + 
'6.可以叫夜夜酱发色图哦，比如\'夜夜酱发色图\' \'夜夜酱我想要一份色图\'之类的。 \n' + 
'7.夜夜酱的ver1.1版本对应16.2岁，随着年龄增长，夜夜酱服侍主人的技术会越来越强的哦。';


export default replyText;